const resAreaData = {
    "code": 200,
    "data": {
        "area": [
            {
                "code": "1",
                "text": "大石龙片区"
            },
            {
                "code": "2",
                "text": "东北片区"
            },
            {
                "code": "3",
                "text": "临深片区"
            },
            {
                "code": "4",
                "text": "松湖片区"
            },
            {
                "code": "5",
                "text": "中心城区"
            },
            {
                "code": "6",
                "text": "滨海片区"
            },
            {
                "code": "7",
                "text": "水乡片区"
            }
        ],
        "subway": [
            {
                "code": "1",
                "subOptions": [
                    {
                        "code": "2",
                        "text": "东莞火车站"
                    },
                    {
                        "code": "3",
                        "text": "茶山"
                    },
                    {
                        "code": "4",
                        "text": "榴花公园"
                    },
                    {
                        "code": "5",
                        "text": "下桥"
                    },
                    {
                        "code": "6",
                        "text": "天宝"
                    },
                    {
                        "code": "7",
                        "text": "东城"
                    },
                    {
                        "code": "8",
                        "text": "旗峰公园"
                    },
                    {
                        "code": "9",
                        "text": "鸿福路"
                    },
                    {
                        "code": "10",
                        "text": "西平"
                    },
                    {
                        "code": "11",
                        "text": "蛤地"
                    },
                    {
                        "code": "12",
                        "text": "陈屋"
                    },
                    {
                        "code": "13",
                        "text": "寮厦"
                    },
                    {
                        "code": "14",
                        "text": "珊美"
                    },
                    {
                        "code": "15",
                        "text": "展览中心"
                    },
                    {
                        "code": "16",
                        "text": "虎门火车站"
                    }
                ],
                "text": "轨道交通2号线"
            }
        ],
        "town": [
            {
                "code": "441900003000",
                "text": "东城街道"
            },
            {
                "code": "441900004000",
                "text": "南城街道"
            },
            {
                "code": "441900005000",
                "text": "万江街道"
            },
            {
                "code": "441900006000",
                "text": "莞城街道"
            },
            {
                "code": "441900101000",
                "text": "石碣镇"
            },
            {
                "code": "441900102000",
                "text": "石龙镇"
            },
            {
                "code": "441900103000",
                "text": "茶山镇"
            },
            {
                "code": "441900104000",
                "text": "石排镇"
            },
            {
                "code": "441900105000",
                "text": "企石镇"
            },
            {
                "code": "441900106000",
                "text": "横沥镇"
            },
            {
                "code": "441900107000",
                "text": "桥头镇"
            },
            {
                "code": "441900108000",
                "text": "谢岗镇"
            },
            {
                "code": "441900109000",
                "text": "东坑镇"
            },
            {
                "code": "441900110000",
                "text": "常平镇"
            },
            {
                "code": "441900111000",
                "text": "寮步镇"
            },
            {
                "code": "441900112000",
                "text": "樟木头镇"
            },
            {
                "code": "441900113000",
                "text": "大朗镇"
            },
            {
                "code": "441900114000",
                "text": "黄江镇"
            },
            {
                "code": "441900115000",
                "text": "清溪镇"
            },
            {
                "code": "441900116000",
                "text": "塘厦镇"
            },
            {
                "code": "441900117000",
                "text": "凤岗镇"
            },
            {
                "code": "441900118000",
                "text": "大岭山镇"
            },
            {
                "code": "441900119000",
                "text": "长安镇"
            },
            {
                "code": "441900121000",
                "text": "虎门镇"
            },
            {
                "code": "441900122000",
                "text": "厚街镇"
            },
            {
                "code": "441900123000",
                "text": "沙田镇"
            },
            {
                "code": "441900124000",
                "text": "道滘镇"
            },
            {
                "code": "441900125000",
                "text": "洪梅镇"
            },
            {
                "code": "441900126000",
                "text": "麻涌镇"
            },
            {
                "code": "441900127000",
                "text": "望牛墩镇"
            },
            {
                "code": "441900128000",
                "text": "中堂镇"
            },
            {
                "code": "441900129000",
                "text": "高埗镇"
            },
            {
                "code": "441900401000",
                "text": "松山湖园区"
            },
            {
                "code": "441900402000",
                "text": "滨海湾新区"
            },
            {
                "code": "441900403000",
                "text": "东莞生态园"
            }
        ]
    },
    "message": "OK",
    "success": true
}

export default resAreaData;